Idealized_Reef_CFD/Scenario_27/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       971008;
    }
    outlet
    {
        type            patch;
        nFaces          43;
        startFace       971033;
    }
    atmosphere
    {
        type            patch;
        nFaces          2820;
        startFace       971076;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          972926;
        startFace       973896;
    }
    bedSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          19763;
        startFace       1946822;
    }
)

// ************************************************************************* //
